benchmark/results/wrk-fiber-multi.log
== fiber [multi] GET /hello  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.33ms  381.73us   6.69ms   73.86%
    Req/Sec   215.19k    23.98k  261.60k    56.00%
  Latency Distribution
     50%    2.27ms
     75%    2.51ms
     90%    2.83ms
     99%    3.54ms
  2137473 requests in 10.01s, 262.96MB read
Requests/sec: 213638.66
Transfer/sec:     26.28MB
== fiber [multi] GET /hello  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.60ms  409.32us   5.04ms   78.65%
    Req/Sec    96.35k     8.95k  112.65k    56.44%
  Latency Distribution
     50%    2.50ms
     75%    2.79ms
     90%    3.13ms
     99%    3.97ms
  1935846 requests in 10.10s, 238.16MB read
Requests/sec: 191620.13
Transfer/sec:     23.57MB
== fiber [multi] GET /hello  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.67ms  522.32us  14.29ms   85.53%
    Req/Sec    47.01k     6.00k  104.33k    90.05%
  Latency Distribution
     50%    2.55ms
     75%    2.87ms
     90%    3.26ms
     99%    4.25ms
  1880027 requests in 10.10s, 231.29MB read
Requests/sec: 186100.90
Transfer/sec:     22.89MB
== fiber [multi] GET /hello  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.61ms  528.25us  10.84ms   87.27%
    Req/Sec    23.85k     4.21k  101.13k    95.76%
  Latency Distribution
     50%    2.49ms
     75%    2.74ms
     90%    3.19ms
     99%    4.15ms
  1903225 requests in 10.10s, 234.14MB read
Requests/sec: 188408.16
Transfer/sec:     23.18MB
== fiber [multi] GET /hello/inon  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.46ms  358.12us   6.98ms   83.02%
    Req/Sec   203.22k     9.73k  222.37k    80.00%
  Latency Distribution
     50%    2.36ms
     75%    2.54ms
     90%    2.94ms
     99%    3.67ms
  2021779 requests in 10.01s, 246.80MB read
Requests/sec: 202059.51
Transfer/sec:     24.67MB
== fiber [multi] GET /hello/inon  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello/inon
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.51ms  364.38us   4.91ms   80.70%
    Req/Sec    99.74k     4.80k  109.88k    70.30%
  Latency Distribution
     50%    2.40ms
     75%    2.63ms
     90%    3.03ms
     99%    3.70ms
  2004499 requests in 10.10s, 244.69MB read
Requests/sec: 198409.67
Transfer/sec:     24.22MB
== fiber [multi] GET /hello/inon  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.50ms  645.51us  25.02ms   95.22%
    Req/Sec    50.49k     2.85k   61.16k    90.00%
  Latency Distribution
     50%    2.41ms
     75%    2.57ms
     90%    2.87ms
     99%    3.58ms
  2009536 requests in 10.00s, 245.30MB read
Requests/sec: 200888.73
Transfer/sec:     24.52MB
== fiber [multi] GET /hello/inon  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/hello/inon
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.50ms  303.22us   4.84ms   82.00%
    Req/Sec    24.85k     1.15k   32.75k    80.69%
  Latency Distribution
     50%    2.43ms
     75%    2.59ms
     90%    2.87ms
     99%    3.58ms
  1997865 requests in 10.10s, 243.88MB read
Requests/sec: 197753.20
Transfer/sec:     24.14MB
== fiber [multi] GET /db  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.66ms  705.66us  11.57ms   75.77%
    Req/Sec    88.71k     5.89k   97.64k    69.00%
  Latency Distribution
     50%    5.50ms
     75%    5.96ms
     90%    6.65ms
     99%    7.90ms
  882318 requests in 10.01s, 152.03MB read
Requests/sec:  88182.94
Transfer/sec:     15.19MB
== fiber [multi] GET /db  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/db
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.69ms    1.40ms  39.58ms   93.77%
    Req/Sec    44.36k     3.55k   49.05k    82.18%
  Latency Distribution
     50%    5.44ms
     75%    5.90ms
     90%    6.67ms
     99%    8.64ms
  891770 requests in 10.10s, 153.66MB read
Requests/sec:  88272.12
Transfer/sec:     15.21MB
== fiber [multi] GET /db  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.46ms  639.56us  12.69ms   79.36%
    Req/Sec    22.97k     0.99k   24.64k    67.82%
  Latency Distribution
     50%    5.32ms
     75%    5.67ms
     90%    6.33ms
     99%    7.56ms
  923356 requests in 10.10s, 159.10MB read
Requests/sec:  91394.30
Transfer/sec:     15.75MB
== fiber [multi] GET /db  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/db
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.19ms  768.23us  11.88ms   80.40%
    Req/Sec    10.04k   607.96    15.78k    81.19%
  Latency Distribution
     50%    6.07ms
     75%    6.49ms
     90%    7.12ms
     99%    8.49ms
  807604 requests in 10.10s, 139.16MB read
Requests/sec:  79938.34
Transfer/sec:     13.77MB
== fiber [multi] POST /echo  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/echo
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.01ms    0.95ms  34.24ms   96.87%
    Req/Sec   167.95k    13.12k  196.63k    88.00%
  Latency Distribution
     50%    2.87ms
     75%    3.12ms
     90%    3.49ms
     99%    4.32ms
  1669763 requests in 10.01s, 253.19MB read
Requests/sec: 166878.46
Transfer/sec:     25.30MB
== fiber [multi] POST /echo  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/echo
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.05ms  513.90us  16.25ms   90.01%
    Req/Sec    82.32k     5.95k   93.63k    93.00%
  Latency Distribution
     50%    2.94ms
     75%    3.17ms
     90%    3.52ms
     99%    4.54ms
  1637464 requests in 10.00s, 248.30MB read
Requests/sec: 163701.09
Transfer/sec:     24.82MB
== fiber [multi] POST /echo  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/echo
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.09ms  579.46us  14.88ms   88.24%
    Req/Sec    40.64k     4.01k   45.96k    85.40%
  Latency Distribution
     50%    2.94ms
     75%    3.25ms
     90%    3.69ms
     99%    5.19ms
  1633402 requests in 10.10s, 247.68MB read
Requests/sec: 161648.53
Transfer/sec:     24.51MB
== fiber [multi] POST /echo  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/echo
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.02ms    1.01ms  35.04ms   95.63%
    Req/Sec    20.82k     1.97k   31.65k    80.82%
  Latency Distribution
     50%    2.86ms
     75%    3.15ms
     90%    3.60ms
     99%    4.76ms
  1673780 requests in 10.10s, 253.80MB read
Requests/sec: 165701.22
Transfer/sec:     25.13MB
== fiber [multi] POST /query  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/query
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.00ms  663.06us  10.31ms   78.66%
    Req/Sec    83.77k     3.10k   90.89k    73.27%
  Latency Distribution
     50%    5.85ms
     75%    6.25ms
     90%    6.83ms
     99%    8.21ms
  841585 requests in 10.10s, 142.86MB read
Requests/sec:  83284.66
Transfer/sec:     14.14MB
== fiber [multi] POST /query  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/query
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.34ms    1.30ms  22.03ms   88.48%
    Req/Sec    39.71k     4.82k   44.94k    81.68%
  Latency Distribution
     50%    5.99ms
     75%    6.67ms
     90%    7.68ms
     99%   11.46ms
  798176 requests in 10.10s, 135.49MB read
Requests/sec:  79005.82
Transfer/sec:     13.41MB
== fiber [multi] POST /query  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/query
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.12ms  756.27us  10.94ms   80.97%
    Req/Sec    20.48k     1.31k   30.35k    86.85%
  Latency Distribution
     50%    5.99ms
     75%    6.41ms
     90%    7.05ms
     99%    8.48ms
  821437 requests in 10.10s, 139.44MB read
Requests/sec:  81315.86
Transfer/sec:     13.80MB
== fiber [multi] POST /query  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3004/query
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.76ms    1.10ms  35.27ms   91.65%
    Req/Sec    10.85k   674.19    12.73k    84.88%
  Latency Distribution
     50%    5.57ms
     75%    5.96ms
     90%    6.65ms
     99%    7.98ms
  871606 requests in 10.10s, 147.96MB read
Requests/sec:  86291.52
Transfer/sec:     14.65MB