benchmark/results/wrk-fiber-single.log
== fiber [single] /hello  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3004/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.99ms  330.93us  11.05ms   95.83%
    Req/Sec   252.27k    16.49k  264.84k    92.16%
  Latency Distribution
     50%    1.95ms
     75%    2.03ms
     90%    2.11ms
     99%    2.93ms
  1278227 requests in 5.10s, 157.25MB read
Requests/sec: 250404.19
Transfer/sec:     30.81MB
== fiber [single] /hello  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3004/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.00ms  502.88us  19.50ms   95.64%
    Req/Sec    62.98k     4.83k   70.73k    84.50%
  Latency Distribution
     50%    1.94ms
     75%    2.03ms
     90%    2.20ms
     99%    3.01ms
  1253203 requests in 5.00s, 154.17MB read
Requests/sec: 250508.23
Transfer/sec:     30.82MB
== fiber [single] /hello/inon  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3004/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.00ms  241.64us   7.75ms   95.62%
    Req/Sec   251.07k    13.29k  274.34k    94.12%
  Latency Distribution
     50%    1.98ms
     75%    2.05ms
     90%    2.12ms
     99%    2.58ms
  1273086 requests in 5.10s, 155.41MB read
Requests/sec: 249431.42
Transfer/sec:     30.45MB
== fiber [single] /hello/inon  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3004/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.04ms  341.42us   9.29ms   92.23%
    Req/Sec    61.42k     4.64k   69.09k    88.24%
  Latency Distribution
     50%    1.99ms
     75%    2.09ms
     90%    2.24ms
     99%    3.30ms
  1246811 requests in 5.10s, 152.20MB read
Requests/sec: 244364.22
Transfer/sec:     29.83MB
== fiber [single] /db  t=1 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3004/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.23ms  661.39us  15.61ms   90.18%
    Req/Sec    96.07k     4.02k  101.35k    88.24%
  Latency Distribution
     50%    5.11ms
     75%    5.31ms
     90%    5.72ms
     99%    7.14ms
  487098 requests in 5.10s, 83.93MB read
Requests/sec:  95426.30
Transfer/sec:     16.44MB
== fiber [single] /db  t=4 c=500 d=5s ==
Running 5s test @ http://127.0.0.1:3004/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.18ms    1.53ms  37.07ms   95.35%
    Req/Sec    24.44k     2.79k   49.01k    95.05%
  Latency Distribution
     50%    5.05ms
     75%    5.25ms
     90%    5.60ms
     99%    7.51ms
  491029 requests in 5.10s, 84.61MB read
Requests/sec:  96254.98
Transfer/sec:     16.59MB